{
  "1a1b": 0,
  "1a1b+": 1,
  "1a1c": 2,
  "1a1c+": 3,
  "1a1d": 4,
  "1a1d+": 5,
  "1a1e": 6,
  "1a1e+": 7,
  "1a1f": 8,
  "1a1f+": 9,
  "1a1g": 10,
  "1a1g+": 11,
  "1a1h+": 12,
  "1a1i+": 13,
  "1a2a": 14,
  "1a2a+": 15,
  "1a2b": 16,
  "1a2b+": 17,
  "1a2c": 18,
  "1a3a": 19,
  "1a3a+": 20,
  "1a3c": 21,
  "1a3c+": 22,
  "1a4a": 23,
  "1a4a+": 24,
  "1a4d": 25,
  "1a4d+": 26,
  "1a5a": 27,
  "1a5a+": 28,
  "1a5e": 29,
  "1a5e+": 30,
  "1a6a": 31,
  "1a6a+": 32,
  "1a6f": 33,
  "1a6f+": 34,
  "1a7a": 35,
  "1a7a+": 36,
  "1a7g": 37,
  "1a7g+": 38,
  "1a8a": 39,
  "1a8a+": 40,
  "1a8h": 41,
  "1a8h+": 42,
  "1a9a": 43,
  "1a9a+": 44,
  "1a9i+": 45,
  "1b1a": 46,
  "1b1a+": 47,
  "1b1c": 48,
  "1b1c+": 49,
  "1b1d": 50,
  "1b1d+": 51,
  "1b1e": 52,
  "1b1e+": 53,
  "1b1f": 54,
  "1b1f+": 55,
  "1b1g": 56,
  "1b1g+": 57,
  "1b1h+": 58,
  "1b1i+": 59,
  "1b2a": 60,
  "1b2a+": 61,
  "1b2b": 62,
  "1b2b+": 63,
  "1b2c": 64,
  "1b2c+": 65,
  "1b2d": 66,
  "1b3b": 67,
  "1b3b+": 68,
  "1b3d": 69,
  "1b3d+": 70,
  "1b4b": 71,
  "1b4b+": 72,
  "1b4e": 73,
  "1b4e+": 74,
  "1b5b": 75,
  "1b5b+": 76,
  "1b5f": 77,
  "1b5f+": 78,
  "1b6b": 79,
  "1b6b+": 80,
  "1b6g+": 81,
  "1b7b": 82,
  "1b7h+": 83,
  "1b8b": 84,
  "1b8b+": 85,
  "1b8i+": 86,
  "1b9b": 87,
  "1b9b+": 88,
  "1c1a": 89,
  "1c1a+": 90,
  "1c1b": 91,
  "1c1b+": 92,
  "1c1d": 93,
  "1c1d+": 94,
  "1c1e": 95,
  "1c1e+": 96,
  "1c1f": 97,
  "1c1g": 98,
  "1c1g+": 99,
  "1c1h+": 100,
  "1c1i+": 101,
  "1c2a+": 102,
  "1c2b": 103,
  "1c2b+": 104,
  "1c2c": 105,
  "1c2c+": 106,
  "1c2d": 107,
  "1c2d+": 108,
  "1c2e": 109,
  "1c3a": 110,
  "1c3a+": 111,
  "1c3c": 112,
  "1c3c+": 113,
  "1c3e": 114,
  "1c3e+": 115,
  "1c4c": 116,
  "1c4c+": 117,
  "1c4f": 118,
  "1c4f+": 119,
  "1c5c": 120,
  "1c5c+": 121,
  "1c5g": 122,
  "1c5g+": 123,
  "1c6c": 124,
  "1c6h": 125,
  "1c6h+": 126,
  "1c7i": 127,
  "1c7i+": 128,
  "1c8c": 129,
  "1d1a": 130,
  "1d1a+": 131,
  "1d1b": 132,
  "1d1b+": 133,
  "1d1c": 134,
  "1d1c+": 135,
  "1d1e": 136,
  "1d1f": 137,
  "1d1g": 138,
  "1d1g+": 139,
  "1d1h": 140,
  "1d1h+": 141,
  "1d1i": 142,
  "1d1i+": 143,
  "1d2b+": 144,
  "1d2c": 145,
  "1d2c+": 146,
  "1d2d": 147,
  "1d2e": 148,
  "1d2f": 149,
  "1d3b": 150,
  "1d3b+": 151,
  "1d3d": 152,
  "1d3f": 153,
  "1d4a": 154,
  "1d4a+": 155,
  "1d4d": 156,
  "1d4g": 157,
  "1d4g+": 158,
  "1d5d": 159,
  "1d5h": 160,
  "1d5h+": 161,
  "1d6d": 162,
  "1d6i": 163,
  "1d6i+": 164,
  "1d7d": 165,
  "1d8d": 166,
  "1d9d": 167,
  "1e1a": 168,
  "1e1a+": 169,
  "1e1b": 170,
  "1e1b+": 171,
  "1e1c": 172,
  "1e1c+": 173,
  "1e1d": 174,
  "1e1f": 175,
  "1e1g": 176,
  "1e1g+": 177,
  "1e1h": 178,
  "1e1h+": 179,
  "1e1i": 180,
  "1e1i+": 181,
  "1e2c": 182,
  "1e2c+": 183,
  "1e2d": 184,
  "1e2e": 185,
  "1e2f": 186,
  "1e2g": 187,
  "1e2g+": 188,
  "1e3c": 189,
  "1e3c+": 190,
  "1e3e": 191,
  "1e3g": 192,
  "1e3g+": 193,
  "1e4b": 194,
  "1e4b+": 195,
  "1e4e": 196,
  "1e4h": 197,
  "1e4h+": 198,
  "1e5a": 199,
  "1e5a+": 200,
  "1e5e": 201,
  "1e5i": 202,
  "1e5i+": 203,
  "1e6e": 204,
  "1e7e": 205,
  "1e8e": 206,
  "1e9e": 207,
  "1f1a": 208,
  "1f1a+": 209,
  "1f1b": 210,
  "1f1b+": 211,
  "1f1c": 212,
  "1f1c+": 213,
  "1f1d": 214,
  "1f1e": 215,
  "1f1g": 216,
  "1f1g+": 217,
  "1f1h": 218,
  "1f1h+": 219,
  "1f1i": 220,
  "1f1i+": 221,
  "1f2d": 222,
  "1f2e": 223,
  "1f2f": 224,
  "1f2g": 225,
  "1f2g+": 226,
  "1f2h+": 227,
  "1f3d": 228,
  "1f3f": 229,
  "1f3h": 230,
  "1f3h+": 231,
  "1f4c": 232,
  "1f4c+": 233,
  "1f4f": 234,
  "1f4i": 235,
  "1f4i+": 236,
  "1f5b": 237,
  "1f5b+": 238,
  "1f5f": 239,
  "1f6a": 240,
  "1f6a+": 241,
  "1f6f": 242,
  "1f7f": 243,
  "1f8f": 244,
  "1f9f": 245,
  "1g1a": 246,
  "1g1a+": 247,
  "1g1b": 248,
  "1g1b+": 249,
  "1g1c": 250,
  "1g1c+": 251,
  "1g1d": 252,
  "1g1d+": 253,
  "1g1e": 254,
  "1g1e+": 255,
  "1g1f": 256,
  "1g1f+": 257,
  "1g1h": 258,
  "1g1h+": 259,
  "1g1i": 260,
  "1g1i+": 261,
  "1g2e": 262,
  "1g2f": 263,
  "1g2f+": 264,
  "1g2g": 265,
  "1g2g+": 266,
  "1g2h": 267,
  "1g2h+": 268,
  "1g2i+": 269,
  "1g3e": 270,
  "1g3e+": 271,
  "1g3g": 272,
  "1g3g+": 273,
  "1g3i": 274,
  "1g3i+": 275,
  "1g4d": 276,
  "1g4d+": 277,
  "1g4g": 278,
  "1g5c": 279,
  "1g5c+": 280,
  "1g5g": 281,
  "1g6b+": 282,
  "1g6g": 283,
  "1g7a+": 284,
  "1g7g": 285,
  "1g7g+": 286,
  "1g9g": 287,
  "1h1a+": 288,
  "1h1b": 289,
  "1h1b+": 290,
  "1h1c": 291,
  "1h1c+": 292,
  "1h1d": 293,
  "1h1d+": 294,
  "1h1e": 295,
  "1h1e+": 296,
  "1h1f": 297,
  "1h1f+": 298,
  "1h1g": 299,
  "1h1g+": 300,
  "1h1i": 301,
  "1h1i+": 302,
  "1h2f": 303,
  "1h2g": 304,
  "1h2g+": 305,
  "1h2h": 306,
  "1h2h+": 307,
  "1h2i": 308,
  "1h2i+": 309,
  "1h3f": 310,
  "1h3f+": 311,
  "1h3h": 312,
  "1h3h+": 313,
  "1h4e": 314,
  "1h4e+": 315,
  "1h4h": 316,
  "1h4h+": 317,
  "1h5d": 318,
  "1h5d+": 319,
  "1h5h": 320,
  "1h5h+": 321,
  "1h6c": 322,
  "1h6c+": 323,
  "1h6h": 324,
  "1h6h+": 325,
  "1h7b+": 326,
  "1h7h": 327,
  "1h7h+": 328,
  "1h8a+": 329,
  "1h8h": 330,
  "1h8h+": 331,
  "1h9h": 332,
  "1i1a+": 333,
  "1i1b+": 334,
  "1i1c": 335,
  "1i1c+": 336,
  "1i1d": 337,
  "1i1d+": 338,
  "1i1e": 339,
  "1i1e+": 340,
  "1i1f": 341,
  "1i1f+": 342,
  "1i1g": 343,
  "1i1g+": 344,
  "1i1h": 345,
  "1i1h+": 346,
  "1i2g": 347,
  "1i2h": 348,
  "1i2h+": 349,
  "1i2i": 350,
  "1i2i+": 351,
  "1i3g": 352,
  "1i3g+": 353,
  "1i3i": 354,
  "1i3i+": 355,
  "1i4f": 356,
  "1i4f+": 357,
  "1i4i": 358,
  "1i4i+": 359,
  "1i5e": 360,
  "1i5e+": 361,
  "1i5i": 362,
  "1i5i+": 363,
  "1i6d": 364,
  "1i6d+": 365,
  "1i6i": 366,
  "1i6i+": 367,
  "1i7c+": 368,
  "1i7i": 369,
  "1i7i+": 370,
  "1i8b+": 371,
  "1i8i": 372,
  "1i8i+": 373,
  "1i9a+": 374,
  "1i9i": 375,
  "1i9i+": 376,
  "2a1a": 377,
  "2a1a+": 378,
  "2a1b": 379,
  "2a1b+": 380,
  "2a1c": 381,
  "2a2b": 382,
  "2a2b+": 383,
  "2a2c": 384,
  "2a2c+": 385,
  "2a2d": 386,
  "2a2d+": 387,
  "2a2e": 388,
  "2a2e+": 389,
  "2a2f": 390,
  "2a2f+": 391,
  "2a2g+": 392,
  "2a2h+": 393,
  "2a2i+": 394,
  "2a3a": 395,
  "2a3a+": 396,
  "2a3b": 397,
  "2a3b+": 398,
  "2a3c": 399,
  "2a4a": 400,
  "2a4a+": 401,
  "2a4c": 402,
  "2a4c+": 403,
  "2a5a": 404,
  "2a5a+": 405,
  "2a5d": 406,
  "2a5d+": 407,
  "2a6a": 408,
  "2a6a+": 409,
  "2a6e": 410,
  "2a6e+": 411,
  "2a7a": 412,
  "2a7a+": 413,
  "2a7f": 414,
  "2a7f+": 415,
  "2a8a": 416,
  "2a8a+": 417,
  "2a8g+": 418,
  "2a9a": 419,
  "2a9a+": 420,
  "2b1a": 421,
  "2b1a+": 422,
  "2b1b": 423,
  "2b1b+": 424,
  "2b1c": 425,
  "2b1c+": 426,
  "2b1d": 427,
  "2b2a": 428,
  "2b2a+": 429,
  "2b2c": 430,
  "2b2c+": 431,
  "2b2d": 432,
  "2b2d+": 433,
  "2b2e": 434,
  "2b2e+": 435,
  "2b2f": 436,
  "2b2f+": 437,
  "2b2g": 438,
  "2b2g+": 439,
  "2b2h": 440,
  "2b2h+": 441,
  "2b2i": 442,
  "2b2i+": 443,
  "2b3a": 444,
  "2b3a+": 445,
  "2b3b": 446,
  "2b3b+": 447,
  "2b3c": 448,
  "2b3c+": 449,
  "2b3d": 450,
  "2b4b": 451,
  "2b4b+": 452,
  "2b4d": 453,
  "2b4d+": 454,
  "2b5b": 455,
  "2b5b+": 456,
  "2b5e": 457,
  "2b5e+": 458,
  "2b6b": 459,
  "2b6b+": 460,
  "2b6f": 461,
  "2b6f+": 462,
  "2b7b": 463,
  "2b7b+": 464,
  "2b7g": 465,
  "2b7g+": 466,
  "2b8b": 467,
  "2b8b+": 468,
  "2b8h": 469,
  "2b8h+": 470,
  "2b9b": 471,
  "2b9i": 472,
  "2b9i+": 473,
  "2c1a+": 474,
  "2c1b": 475,
  "2c1b+": 476,
  "2c1c": 477,
  "2c1c+": 478,
  "2c1d": 479,
  "2c1d+": 480,
  "2c1e": 481,
  "2c2a": 482,
  "2c2a+": 483,
  "2c2b": 484,
  "2c2b+": 485,
  "2c2d": 486,
  "2c2d+": 487,
  "2c2e": 488,
  "2c2e+": 489,
  "2c2f": 490,
  "2c2f+": 491,
  "2c2g": 492,
  "2c2g+": 493,
  "2c2h": 494,
  "2c2h+": 495,
  "2c2i": 496,
  "2c2i+": 497,
  "2c3a+": 498,
  "2c3b": 499,
  "2c3b+": 500,
  "2c3c": 501,
  "2c3c+": 502,
  "2c3d": 503,
  "2c3d+": 504,
  "2c3e": 505,
  "2c4a": 506,
  "2c4a+": 507,
  "2c4c": 508,
  "2c4c+": 509,
  "2c4e": 510,
  "2c4e+": 511,
  "2c5c": 512,
  "2c5c+": 513,
  "2c5f": 514,
  "2c5f+": 515,
  "2c6c": 516,
  "2c6c+": 517,
  "2c6g": 518,
  "2c6g+": 519,
  "2c7c": 520,
  "2c7c+": 521,
  "2c7h+": 522,
  "2c8c": 523,
  "2c8i+": 524,
  "2c9c": 525,
  "2d1b+": 526,
  "2d1c": 527,
  "2d1c+": 528,
  "2d1d": 529,
  "2d1e": 530,
  "2d1f": 531,
  "2d2a": 532,
  "2d2a+": 533,
  "2d2b": 534,
  "2d2b+": 535,
  "2d2c": 536,
  "2d2c+": 537,
  "2d2e": 538,
  "2d2f": 539,
  "2d2g": 540,
  "2d2g+": 541,
  "2d2h": 542,
  "2d2h+": 543,
  "2d2i": 544,
  "2d2i+": 545,
  "2d3b+": 546,
  "2d3c": 547,
  "2d3c+": 548,
  "2d3d": 549,
  "2d3e": 550,
  "2d3f": 551,
  "2d4b": 552,
  "2d4b+": 553,
  "2d4d": 554,
  "2d4f": 555,
  "2d5a": 556,
  "2d5a+": 557,
  "2d5d": 558,
  "2d5g": 559,
  "2d5g+": 560,
  "2d6d": 561,
  "2d6h": 562,
  "2d6h+": 563,
  "2d7d": 564,
  "2d7i": 565,
  "2d7i+": 566,
  "2d8d": 567,
  "2d9d": 568,
  "2e1c": 569,
  "2e1c+": 570,
  "2e1d": 571,
  "2e1e": 572,
  "2e1f": 573,
  "2e1g": 574,
  "2e1g+": 575,
  "2e2a": 576,
  "2e2a+": 577,
  "2e2b": 578,
  "2e2b+": 579,
  "2e2c": 580,
  "2e2c+": 581,
  "2e2d": 582,
  "2e2f": 583,
  "2e2g": 584,
  "2e2g+": 585,
  "2e2h": 586,
  "2e2h+": 587,
  "2e2i": 588,
  "2e2i+": 589,
  "2e3c": 590,
  "2e3c+": 591,
  "2e3d": 592,
  "2e3e": 593,
  "2e3f": 594,
  "2e3g": 595,
  "2e3g+": 596,
  "2e4c": 597,
  "2e4c+": 598,
  "2e4e": 599,
  "2e4g": 600,
  "2e4g+": 601,
  "2e5b": 602,
  "2e5b+": 603,
  "2e5e": 604,
  "2e5h": 605,
  "2e5h+": 606,
  "2e6a": 607,
  "2e6a+": 608,
  "2e6e": 609,
  "2e6i": 610,
  "2e6i+": 611,
  "2e7e": 612,
  "2e8e": 613,
  "2e9e": 614,
  "2f1d": 615,
  "2f1e": 616,
  "2f1f": 617,
  "2f1g": 618,
  "2f1g+": 619,
  "2f1h+": 620,
  "2f2a": 621,
  "2f2a+": 622,
  "2f2b": 623,
  "2f2b+": 624,
  "2f2c": 625,
  "2f2c+": 626,
  "2f2d": 627,
  "2f2e": 628,
  "2f2g": 629,
  "2f2g+": 630,
  "2f2h": 631,
  "2f2h+": 632,
  "2f2i": 633,
  "2f2i+": 634,
  "2f3d": 635,
  "2f3e": 636,
  "2f3f": 637,
  "2f3g": 638,
  "2f3g+": 639,
  "2f3h+": 640,
  "2f4d": 641,
  "2f4f": 642,
  "2f4h": 643,
  "2f4h+": 644,
  "2f5c": 645,
  "2f5c+": 646,
  "2f5f": 647,
  "2f5i": 648,
  "2f5i+": 649,
  "2f6b": 650,
  "2f6b+": 651,
  "2f6f": 652,
  "2f7a": 653,
  "2f7a+": 654,
  "2f7f": 655,
  "2f8f": 656,
  "2f9f": 657,
  "2g1e": 658,
  "2g1f": 659,
  "2g1f+": 660,
  "2g1g": 661,
  "2g1g+": 662,
  "2g1h": 663,
  "2g1h+": 664,
  "2g1i+": 665,
  "2g2a": 666,
  "2g2a+": 667,
  "2g2b": 668,
  "2g2b+": 669,
  "2g2c": 670,
  "2g2c+": 671,
  "2g2d": 672,
  "2g2d+": 673,
  "2g2e": 674,
  "2g2e+": 675,
  "2g2f": 676,
  "2g2f+": 677,
  "2g2h": 678,
  "2g2h+": 679,
  "2g2i": 680,
  "2g2i+": 681,
  "2g3e": 682,
  "2g3f": 683,
  "2g3f+": 684,
  "2g3g": 685,
  "2g3g+": 686,
  "2g3h": 687,
  "2g3h+": 688,
  "2g3i+": 689,
  "2g4e": 690,
  "2g4e+": 691,
  "2g4g": 692,
  "2g4g+": 693,
  "2g4i": 694,
  "2g4i+": 695,
  "2g5d": 696,
  "2g5d+": 697,
  "2g5g": 698,
  "2g5g+": 699,
  "2g6c": 700,
  "2g6c+": 701,
  "2g6g": 702,
  "2g6g+": 703,
  "2g7b+": 704,
  "2g7g": 705,
  "2g8a+": 706,
  "2g8g": 707,
  "2g8g+": 708,
  "2g9g": 709,
  "2h1f": 710,
  "2h1g": 711,
  "2h1g+": 712,
  "2h1h": 713,
  "2h1h+": 714,
  "2h1i": 715,
  "2h1i+": 716,
  "2h2a": 717,
  "2h2a+": 718,
  "2h2b": 719,
  "2h2b+": 720,
  "2h2c": 721,
  "2h2c+": 722,
  "2h2d": 723,
  "2h2d+": 724,
  "2h2e": 725,
  "2h2e+": 726,
  "2h2f": 727,
  "2h2f+": 728,
  "2h2g": 729,
  "2h2g+": 730,
  "2h2i": 731,
  "2h2i+": 732,
  "2h3f": 733,
  "2h3g": 734,
  "2h3g+": 735,
  "2h3h": 736,
  "2h3h+": 737,
  "2h3i": 738,
  "2h3i+": 739,
  "2h4f": 740,
  "2h4f+": 741,
  "2h4h": 742,
  "2h4h+": 743,
  "2h5e": 744,
  "2h5e+": 745,
  "2h5h": 746,
  "2h5h+": 747,
  "2h6d": 748,
  "2h6d+": 749,
  "2h6h": 750,
  "2h6h+": 751,
  "2h7c": 752,
  "2h7c+": 753,
  "2h7h": 754,
  "2h7h+": 755,
  "2h8b+": 756,
  "2h8h": 757,
  "2h8h+": 758,
  "2h9a": 759,
  "2h9a+": 760,
  "2h9h": 761,
  "2i1g": 762,
  "2i1h": 763,
  "2i1h+": 764,
  "2i1i": 765,
  "2i1i+": 766,
  "2i2a+": 767,
  "2i2b+": 768,
  "2i2c": 769,
  "2i2c+": 770,
  "2i2d": 771,
  "2i2d+": 772,
  "2i2e": 773,
  "2i2e+": 774,
  "2i2f": 775,
  "2i2f+": 776,
  "2i2g": 777,
  "2i2g+": 778,
  "2i2h": 779,
  "2i2h+": 780,
  "2i3g": 781,
  "2i3h": 782,
  "2i3h+": 783,
  "2i3i": 784,
  "2i3i+": 785,
  "2i4g": 786,
  "2i4g+": 787,
  "2i4i": 788,
  "2i4i+": 789,
  "2i5f": 790,
  "2i5f+": 791,
  "2i5i": 792,
  "2i5i+": 793,
  "2i6e": 794,
  "2i6e+": 795,
  "2i6i": 796,
  "2i6i+": 797,
  "2i7d": 798,
  "2i7d+": 799,
  "2i7i": 800,
  "2i7i+": 801,
  "2i8c+": 802,
  "2i8i": 803,
  "2i8i+": 804,
  "2i9b+": 805,
  "2i9i": 806,
  "2i9i+": 807,
  "3a1a": 808,
  "3a1a+": 809,
  "3a1c": 810,
  "3a1c+": 811,
  "3a2a": 812,
  "3a2a+": 813,
  "3a2b": 814,
  "3a2b+": 815,
  "3a2c": 816,
  "3a3b": 817,
  "3a3b+": 818,
  "3a3c": 819,
  "3a3c+": 820,
  "3a3d": 821,
  "3a3d+": 822,
  "3a3e": 823,
  "3a3e+": 824,
  "3a3f": 825,
  "3a3f+": 826,
  "3a3g+": 827,
  "3a3h+": 828,
  "3a3i+": 829,
  "3a4a": 830,
  "3a4a+": 831,
  "3a4b": 832,
  "3a4b+": 833,
  "3a4c": 834,
  "3a5a": 835,
  "3a5a+": 836,
  "3a5c": 837,
  "3a5c+": 838,
  "3a6a": 839,
  "3a6a+": 840,
  "3a6d": 841,
  "3a6d+": 842,
  "3a7a": 843,
  "3a7a+": 844,
  "3a7e": 845,
  "3a7e+": 846,
  "3a8a": 847,
  "3a8a+": 848,
  "3a8f": 849,
  "3a8f+": 850,
  "3a9a": 851,
  "3a9a+": 852,
  "3a9g": 853,
  "3a9g+": 854,
  "3b1b": 855,
  "3b1b+": 856,
  "3b1d": 857,
  "3b1d+": 858,
  "3b2a": 859,
  "3b2a+": 860,
  "3b2b": 861,
  "3b2b+": 862,
  "3b2c": 863,
  "3b2c+": 864,
  "3b2d": 865,
  "3b3a": 866,
  "3b3a+": 867,
  "3b3c": 868,
  "3b3c+": 869,
  "3b3d": 870,
  "3b3d+": 871,
  "3b3e": 872,
  "3b3e+": 873,
  "3b3f": 874,
  "3b3f+": 875,
  "3b3g": 876,
  "3b3g+": 877,
  "3b3h+": 878,
  "3b3i+": 879,
  "3b4a": 880,
  "3b4a+": 881,
  "3b4b": 882,
  "3b4b+": 883,
  "3b4c": 884,
  "3b4c+": 885,
  "3b4d": 886,
  "3b5b": 887,
  "3b5b+": 888,
  "3b5d": 889,
  "3b5d+": 890,
  "3b6b": 891,
  "3b6b+": 892,
  "3b6e": 893,
  "3b6e+": 894,
  "3b7b": 895,
  "3b7b+": 896,
  "3b7f": 897,
  "3b7f+": 898,
  "3b8b": 899,
  "3b8b+": 900,
  "3b8g+": 901,
  "3b9b": 902,
  "3b9h+": 903,
  "3c1a": 904,
  "3c1a+": 905,
  "3c1c": 906,
  "3c1c+": 907,
  "3c1e": 908,
  "3c1e+": 909,
  "3c2a+": 910,
  "3c2b": 911,
  "3c2b+": 912,
  "3c2c": 913,
  "3c2c+": 914,
  "3c2d": 915,
  "3c2d+": 916,
  "3c2e": 917,
  "3c3a": 918,
  "3c3a+": 919,
  "3c3b": 920,
  "3c3b+": 921,
  "3c3d": 922,
  "3c3d+": 923,
  "3c3e": 924,
  "3c3e+": 925,
  "3c3f": 926,
  "3c3f+": 927,
  "3c3g": 928,
  "3c3g+": 929,
  "3c3h+": 930,
  "3c3i": 931,
  "3c3i+": 932,
  "3c4a+": 933,
  "3c4b": 934,
  "3c4b+": 935,
  "3c4c": 936,
  "3c4c+": 937,
  "3c4d": 938,
  "3c4d+": 939,
  "3c4e": 940,
  "3c5a": 941,
  "3c5a+": 942,
  "3c5c": 943,
  "3c5c+": 944,
  "3c5e": 945,
  "3c5e+": 946,
  "3c6c": 947,
  "3c6c+": 948,
  "3c6f": 949,
  "3c6f+": 950,
  "3c7c": 951,
  "3c7c+": 952,
  "3c7g": 953,
  "3c7g+": 954,
  "3c8c": 955,
  "3c8c+": 956,
  "3c8h": 957,
  "3c8h+": 958,
  "3c9c": 959,
  "3c9i": 960,
  "3c9i+": 961,
  "3d1b": 962,
  "3d1b+": 963,
  "3d1d": 964,
  "3d1f": 965,
  "3d2b+": 966,
  "3d2c": 967,
  "3d2c+": 968,
  "3d2d": 969,
  "3d2e": 970,
  "3d2f": 971,
  "3d3a": 972,
  "3d3a+": 973,
  "3d3b": 974,
  "3d3b+": 975,
  "3d3c": 976,
  "3d3c+": 977,
  "3d3e": 978,
  "3d3f": 979,
  "3d3g": 980,
  "3d3g+": 981,
  "3d3h": 982,
  "3d3h+": 983,
  "3d3i": 984,
  "3d3i+": 985,
  "3d4b+": 986,
  "3d4c": 987,
  "3d4c+": 988,
  "3d4d": 989,
  "3d4e": 990,
  "3d4f": 991,
  "3d5b": 992,
  "3d5b+": 993,
  "3d5d": 994,
  "3d5f": 995,
  "3d6a": 996,
  "3d6a+": 997,
  "3d6d": 998,
  "3d6g": 999,
  "3d6g+": 1000,
  "3d7d": 1001,
  "3d7h": 1002,
  "3d7h+": 1003,
  "3d8d": 1004,
  "3d8i": 1005,
  "3d8i+": 1006,
  "3d9d": 1007,
  "3e1c": 1008,
  "3e1c+": 1009,
  "3e1e": 1010,
  "3e1g": 1011,
  "3e1g+": 1012,
  "3e2c": 1013,
  "3e2c+": 1014,
  "3e2d": 1015,
  "3e2e": 1016,
  "3e2f": 1017,
  "3e2g": 1018,
  "3e2g+": 1019,
  "3e3a": 1020,
  "3e3a+": 1021,
  "3e3b": 1022,
  "3e3b+": 1023,
  "3e3c": 1024,
  "3e3c+": 1025,
  "3e3d": 1026,
  "3e3f": 1027,
  "3e3g": 1028,
  "3e3g+": 1029,
  "3e3h": 1030,
  "3e3h+": 1031,
  "3e3i": 1032,
  "3e3i+": 1033,
  "3e4c": 1034,
  "3e4c+": 1035,
  "3e4d": 1036,
  "3e4e": 1037,
  "3e4f": 1038,
  "3e4g": 1039,
  "3e4g+": 1040,
  "3e5c": 1041,
  "3e5c+": 1042,
  "3e5e": 1043,
  "3e5g": 1044,
  "3e5g+": 1045,
  "3e6b": 1046,
  "3e6b+": 1047,
  "3e6e": 1048,
  "3e6h": 1049,
  "3e6h+": 1050,
  "3e7a": 1051,
  "3e7a+": 1052,
  "3e7e": 1053,
  "3e7i": 1054,
  "3e7i+": 1055,
  "3e8e": 1056,
  "3e9e": 1057,
  "3f1d": 1058,
  "3f1f": 1059,
  "3f1h": 1060,
  "3f1h+": 1061,
  "3f2d": 1062,
  "3f2e": 1063,
  "3f2f": 1064,
  "3f2g": 1065,
  "3f2g+": 1066,
  "3f2h+": 1067,
  "3f3a": 1068,
  "3f3a+": 1069,
  "3f3b": 1070,
  "3f3b+": 1071,
  "3f3c": 1072,
  "3f3c+": 1073,
  "3f3d": 1074,
  "3f3e": 1075,
  "3f3g": 1076,
  "3f3g+": 1077,
  "3f3h": 1078,
  "3f3h+": 1079,
  "3f3i": 1080,
  "3f3i+": 1081,
  "3f4d": 1082,
  "3f4e": 1083,
  "3f4f": 1084,
  "3f4g": 1085,
  "3f4g+": 1086,
  "3f4h+": 1087,
  "3f5d": 1088,
  "3f5f": 1089,
  "3f5h": 1090,
  "3f5h+": 1091,
  "3f6c": 1092,
  "3f6c+": 1093,
  "3f6f": 1094,
  "3f6i": 1095,
  "3f6i+": 1096,
  "3f7b": 1097,
  "3f7b+": 1098,
  "3f7f": 1099,
  "3f8a": 1100,
  "3f8a+": 1101,
  "3f8f": 1102,
  "3f9f": 1103,
  "3g1e": 1104,
  "3g1e+": 1105,
  "3g1g": 1106,
  "3g1g+": 1107,
  "3g1i": 1108,
  "3g1i+": 1109,
  "3g2e": 1110,
  "3g2f": 1111,
  "3g2f+": 1112,
  "3g2g": 1113,
  "3g2g+": 1114,
  "3g2h": 1115,
  "3g2h+": 1116,
  "3g2i+": 1117,
  "3g3a+": 1118,
  "3g3b+": 1119,
  "3g3c": 1120,
  "3g3c+": 1121,
  "3g3d": 1122,
  "3g3d+": 1123,
  "3g3e": 1124,
  "3g3e+": 1125,
  "3g3f": 1126,
  "3g3f+": 1127,
  "3g3h": 1128,
  "3g3h+": 1129,
  "3g3i": 1130,
  "3g3i+": 1131,
  "3g4e": 1132,
  "3g4f": 1133,
  "3g4f+": 1134,
  "3g4g": 1135,
  "3g4g+": 1136,
  "3g4h": 1137,
  "3g4h+": 1138,
  "3g4i+": 1139,
  "3g5e": 1140,
  "3g5e+": 1141,
  "3g5g": 1142,
  "3g5g+": 1143,
  "3g5i": 1144,
  "3g5i+": 1145,
  "3g6d": 1146,
  "3g6d+": 1147,
  "3g6g": 1148,
  "3g6g+": 1149,
  "3g7c": 1150,
  "3g7c+": 1151,
  "3g7g": 1152,
  "3g7g+": 1153,
  "3g8b+": 1154,
  "3g8g": 1155,
  "3g8g+": 1156,
  "3g9a": 1157,
  "3g9a+": 1158,
  "3h1f": 1159,
  "3h1f+": 1160,
  "3h1h": 1161,
  "3h1h+": 1162,
  "3h2f": 1163,
  "3h2g": 1164,
  "3h2g+": 1165,
  "3h2h": 1166,
  "3h2h+": 1167,
  "3h2i": 1168,
  "3h2i+": 1169,
  "3h3a+": 1170,
  "3h3b": 1171,
  "3h3b+": 1172,
  "3h3c": 1173,
  "3h3c+": 1174,
  "3h3d": 1175,
  "3h3d+": 1176,
  "3h3e": 1177,
  "3h3e+": 1178,
  "3h3f": 1179,
  "3h3f+": 1180,
  "3h3g": 1181,
  "3h3g+": 1182,
  "3h3i": 1183,
  "3h3i+": 1184,
  "3h4f": 1185,
  "3h4g": 1186,
  "3h4g+": 1187,
  "3h4h": 1188,
  "3h4h+": 1189,
  "3h4i": 1190,
  "3h4i+": 1191,
  "3h5f": 1192,
  "3h5f+": 1193,
  "3h5h": 1194,
  "3h5h+": 1195,
  "3h6e": 1196,
  "3h6e+": 1197,
  "3h6h": 1198,
  "3h6h+": 1199,
  "3h7d": 1200,
  "3h7d+": 1201,
  "3h7h": 1202,
  "3h7h+": 1203,
  "3h8c": 1204,
  "3h8c+": 1205,
  "3h8h": 1206,
  "3h8h+": 1207,
  "3h9b+": 1208,
  "3h9h": 1209,
  "3h9h+": 1210,
  "3i1g": 1211,
  "3i1g+": 1212,
  "3i1i": 1213,
  "3i1i+": 1214,
  "3i2g": 1215,
  "3i2h": 1216,
  "3i2h+": 1217,
  "3i2i": 1218,
  "3i2i+": 1219,
  "3i3a+": 1220,
  "3i3b": 1221,
  "3i3b+": 1222,
  "3i3c": 1223,
  "3i3c+": 1224,
  "3i3d": 1225,
  "3i3d+": 1226,
  "3i3e": 1227,
  "3i3e+": 1228,
  "3i3f": 1229,
  "3i3f+": 1230,
  "3i3g": 1231,
  "3i3g+": 1232,
  "3i3h": 1233,
  "3i3h+": 1234,
  "3i4g": 1235,
  "3i4h": 1236,
  "3i4h+": 1237,
  "3i4i": 1238,
  "3i4i+": 1239,
  "3i5g": 1240,
  "3i5g+": 1241,
  "3i5i": 1242,
  "3i5i+": 1243,
  "3i6f": 1244,
  "3i6f+": 1245,
  "3i6i": 1246,
  "3i6i+": 1247,
  "3i7e": 1248,
  "3i7e+": 1249,
  "3i7i": 1250,
  "3i7i+": 1251,
  "3i8d": 1252,
  "3i8d+": 1253,
  "3i8i": 1254,
  "3i8i+": 1255,
  "3i9c+": 1256,
  "3i9i": 1257,
  "3i9i+": 1258,
  "4a1a": 1259,
  "4a1a+": 1260,
  "4a1d": 1261,
  "4a1d+": 1262,
  "4a2a": 1263,
  "4a2a+": 1264,
  "4a2c": 1265,
  "4a2c+": 1266,
  "4a3a": 1267,
  "4a3a+": 1268,
  "4a3b": 1269,
  "4a3b+": 1270,
  "4a3c": 1271,
  "4a4b": 1272,
  "4a4b+": 1273,
  "4a4c": 1274,
  "4a4c+": 1275,
  "4a4d": 1276,
  "4a4d+": 1277,
  "4a4e": 1278,
  "4a4e+": 1279,
  "4a4f": 1280,
  "4a4f+": 1281,
  "4a4g": 1282,
  "4a4g+": 1283,
  "4a4h+": 1284,
  "4a4i+": 1285,
  "4a5a": 1286,
  "4a5a+": 1287,
  "4a5b": 1288,
  "4a5b+": 1289,
  "4a5c": 1290,
  "4a6a": 1291,
  "4a6a+": 1292,
  "4a6c": 1293,
  "4a6c+": 1294,
  "4a7a": 1295,
  "4a7a+": 1296,
  "4a7d": 1297,
  "4a7d+": 1298,
  "4a8a": 1299,
  "4a8a+": 1300,
  "4a8e": 1301,
  "4a8e+": 1302,
  "4a9a": 1303,
  "4a9a+": 1304,
  "4a9f": 1305,
  "4a9f+": 1306,
  "4b1b": 1307,
  "4b1b+": 1308,
  "4b1e": 1309,
  "4b1e+": 1310,
  "4b2b": 1311,
  "4b2b+": 1312,
  "4b2d": 1313,
  "4b2d+": 1314,
  "4b3a": 1315,
  "4b3a+": 1316,
  "4b3b": 1317,
  "4b3b+": 1318,
  "4b3c": 1319,
  "4b3c+": 1320,
  "4b3d": 1321,
  "4b4a": 1322,
  "4b4a+": 1323,
  "4b4c": 1324,
  "4b4c+": 1325,
  "4b4d": 1326,
  "4b4d+": 1327,
  "4b4e": 1328,
  "4b4e+": 1329,
  "4b4f": 1330,
  "4b4f+": 1331,
  "4b4g": 1332,
  "4b4g+": 1333,
  "4b4h+": 1334,
  "4b4i": 1335,
  "4b4i+": 1336,
  "4b5a": 1337,
  "4b5a+": 1338,
  "4b5b": 1339,
  "4b5b+": 1340,
  "4b5c": 1341,
  "4b5c+": 1342,
  "4b5d": 1343,
  "4b6b": 1344,
  "4b6b+": 1345,
  "4b6d": 1346,
  "4b6d+": 1347,
  "4b7b": 1348,
  "4b7b+": 1349,
  "4b7e": 1350,
  "4b7e+": 1351,
  "4b8b": 1352,
  "4b8b+": 1353,
  "4b8f": 1354,
  "4b8f+": 1355,
  "4b9b": 1356,
  "4b9b+": 1357,
  "4b9g": 1358,
  "4b9g+": 1359,
  "4c1c": 1360,
  "4c1f": 1361,
  "4c1f+": 1362,
  "4c2a": 1363,
  "4c2a+": 1364,
  "4c2c": 1365,
  "4c2c+": 1366,
  "4c2e": 1367,
  "4c2e+": 1368,
  "4c3a+": 1369,
  "4c3b": 1370,
  "4c3b+": 1371,
  "4c3c": 1372,
  "4c3c+": 1373,
  "4c3d": 1374,
  "4c3d+": 1375,
  "4c3e": 1376,
  "4c4a": 1377,
  "4c4a+": 1378,
  "4c4b": 1379,
  "4c4b+": 1380,
  "4c4d": 1381,
  "4c4d+": 1382,
  "4c4e": 1383,
  "4c4e+": 1384,
  "4c4f": 1385,
  "4c4f+": 1386,
  "4c4g": 1387,
  "4c4g+": 1388,
  "4c4h": 1389,
  "4c4h+": 1390,
  "4c4i+": 1391,
  "4c5a+": 1392,
  "4c5b": 1393,
  "4c5b+": 1394,
  "4c5c": 1395,
  "4c5c+": 1396,
  "4c5d": 1397,
  "4c5d+": 1398,
  "4c5e": 1399,
  "4c6a": 1400,
  "4c6a+": 1401,
  "4c6c": 1402,
  "4c6c+": 1403,
  "4c6e": 1404,
  "4c6e+": 1405,
  "4c7c": 1406,
  "4c7c+": 1407,
  "4c7f": 1408,
  "4c7f+": 1409,
  "4c8c": 1410,
  "4c8g": 1411,
  "4c8g+": 1412,
  "4c9c": 1413,
  "4c9h": 1414,
  "4c9h+": 1415,
  "4d1a": 1416,
  "4d1a+": 1417,
  "4d1d": 1418,
  "4d1g": 1419,
  "4d1g+": 1420,
  "4d2b": 1421,
  "4d2b+": 1422,
  "4d2d": 1423,
  "4d2f": 1424,
  "4d3b+": 1425,
  "4d3c": 1426,
  "4d3c+": 1427,
  "4d3d": 1428,
  "4d3e": 1429,
  "4d3f": 1430,
  "4d4a": 1431,
  "4d4a+": 1432,
  "4d4b": 1433,
  "4d4b+": 1434,
  "4d4c": 1435,
  "4d4c+": 1436,
  "4d4e": 1437,
  "4d4f": 1438,
  "4d4g": 1439,
  "4d4g+": 1440,
  "4d4h": 1441,
  "4d4h+": 1442,
  "4d4i": 1443,
  "4d4i+": 1444,
  "4d5b+": 1445,
  "4d5c": 1446,
  "4d5c+": 1447,
  "4d5d": 1448,
  "4d5e": 1449,
  "4d5f": 1450,
  "4d6b": 1451,
  "4d6b+": 1452,
  "4d6d": 1453,
  "4d6f": 1454,
  "4d7a": 1455,
  "4d7a+": 1456,
  "4d7d": 1457,
  "4d7g": 1458,
  "4d7g+": 1459,
  "4d8d": 1460,
  "4d8h": 1461,
  "4d8h+": 1462,
  "4d9d": 1463,
  "4d9i": 1464,
  "4d9i+": 1465,
  "4e1b": 1466,
  "4e1b+": 1467,
  "4e1e": 1468,
  "4e1h": 1469,
  "4e1h+": 1470,
  "4e2c": 1471,
  "4e2c+": 1472,
  "4e2e": 1473,
  "4e2g": 1474,
  "4e2g+": 1475,
  "4e3c": 1476,
  "4e3c+": 1477,
  "4e3d": 1478,
  "4e3e": 1479,
  "4e3f": 1480,
  "4e3g": 1481,
  "4e3g+": 1482,
  "4e4a": 1483,
  "4e4a+": 1484,
  "4e4b": 1485,
  "4e4b+": 1486,
  "4e4c": 1487,
  "4e4c+": 1488,
  "4e4d": 1489,
  "4e4f": 1490,
  "4e4g": 1491,
  "4e4g+": 1492,
  "4e4h": 1493,
  "4e4h+": 1494,
  "4e4i": 1495,
  "4e4i+": 1496,
  "4e5c": 1497,
  "4e5c+": 1498,
  "4e5d": 1499,
  "4e5e": 1500,
  "4e5f": 1501,
  "4e5g": 1502,
  "4e5g+": 1503,
  "4e6c": 1504,
  "4e6c+": 1505,
  "4e6e": 1506,
  "4e6g": 1507,
  "4e6g+": 1508,
  "4e7b": 1509,
  "4e7b+": 1510,
  "4e7e": 1511,
  "4e7h": 1512,
  "4e7h+": 1513,
  "4e8a": 1514,
  "4e8a+": 1515,
  "4e8e": 1516,
  "4e8i": 1517,
  "4e8i+": 1518,
  "4e9e": 1519,
  "4f1c": 1520,
  "4f1c+": 1521,
  "4f1f": 1522,
  "4f1i": 1523,
  "4f1i+": 1524,
  "4f2d": 1525,
  "4f2f": 1526,
  "4f2h": 1527,
  "4f2h+": 1528,
  "4f3d": 1529,
  "4f3e": 1530,
  "4f3f": 1531,
  "4f3g": 1532,
  "4f3g+": 1533,
  "4f3h+": 1534,
  "4f4a": 1535,
  "4f4a+": 1536,
  "4f4b": 1537,
  "4f4b+": 1538,
  "4f4c": 1539,
  "4f4c+": 1540,
  "4f4d": 1541,
  "4f4e": 1542,
  "4f4g": 1543,
  "4f4g+": 1544,
  "4f4h": 1545,
  "4f4h+": 1546,
  "4f4i": 1547,
  "4f4i+": 1548,
  "4f5d": 1549,
  "4f5e": 1550,
  "4f5f": 1551,
  "4f5g": 1552,
  "4f5g+": 1553,
  "4f5h+": 1554,
  "4f6d": 1555,
  "4f6f": 1556,
  "4f6h": 1557,
  "4f6h+": 1558,
  "4f7c": 1559,
  "4f7c+": 1560,
  "4f7f": 1561,
  "4f7i": 1562,
  "4f7i+": 1563,
  "4f8b": 1564,
  "4f8b+": 1565,
  "4f8f": 1566,
  "4f9a": 1567,
  "4f9a+": 1568,
  "4f9f": 1569,
  "4g1d": 1570,
  "4g1d+": 1571,
  "4g1g": 1572,
  "4g1g+": 1573,
  "4g2e": 1574,
  "4g2e+": 1575,
  "4g2g": 1576,
  "4g2g+": 1577,
  "4g2i": 1578,
  "4g2i+": 1579,
  "4g3e": 1580,
  "4g3f": 1581,
  "4g3f+": 1582,
  "4g3g": 1583,
  "4g3g+": 1584,
  "4g3h": 1585,
  "4g3h+": 1586,
  "4g3i+": 1587,
  "4g4a+": 1588,
  "4g4b+": 1589,
  "4g4c": 1590,
  "4g4c+": 1591,
  "4g4d": 1592,
  "4g4d+": 1593,
  "4g4e": 1594,
  "4g4e+": 1595,
  "4g4f": 1596,
  "4g4f+": 1597,
  "4g4h": 1598,
  "4g4h+": 1599,
  "4g4i": 1600,
  "4g4i+": 1601,
  "4g5e": 1602,
  "4g5f": 1603,
  "4g5f+": 1604,
  "4g5g": 1605,
  "4g5g+": 1606,
  "4g5h": 1607,
  "4g5h+": 1608,
  "4g5i+": 1609,
  "4g6e": 1610,
  "4g6e+": 1611,
  "4g6g": 1612,
  "4g6g+": 1613,
  "4g6i": 1614,
  "4g6i+": 1615,
  "4g7d": 1616,
  "4g7d+": 1617,
  "4g7g": 1618,
  "4g7g+": 1619,
  "4g8c+": 1620,
  "4g8g": 1621,
  "4g8g+": 1622,
  "4g9b": 1623,
  "4g9b+": 1624,
  "4g9g": 1625,
  "4h1e": 1626,
  "4h1e+": 1627,
  "4h1h": 1628,
  "4h1h+": 1629,
  "4h2f": 1630,
  "4h2f+": 1631,
  "4h2h": 1632,
  "4h2h+": 1633,
  "4h3f": 1634,
  "4h3g": 1635,
  "4h3g+": 1636,
  "4h3h": 1637,
  "4h3h+": 1638,
  "4h3i": 1639,
  "4h3i+": 1640,
  "4h4a": 1641,
  "4h4a+": 1642,
  "4h4b": 1643,
  "4h4b+": 1644,
  "4h4c": 1645,
  "4h4c+": 1646,
  "4h4d": 1647,
  "4h4d+": 1648,
  "4h4e": 1649,
  "4h4e+": 1650,
  "4h4f": 1651,
  "4h4f+": 1652,
  "4h4g": 1653,
  "4h4g+": 1654,
  "4h4i": 1655,
  "4h4i+": 1656,
  "4h5f": 1657,
  "4h5g": 1658,
  "4h5g+": 1659,
  "4h5h": 1660,
  "4h5h+": 1661,
  "4h5i": 1662,
  "4h5i+": 1663,
  "4h6f": 1664,
  "4h6f+": 1665,
  "4h6h": 1666,
  "4h6h+": 1667,
  "4h7e": 1668,
  "4h7e+": 1669,
  "4h7h": 1670,
  "4h7h+": 1671,
  "4h8d": 1672,
  "4h8d+": 1673,
  "4h8h": 1674,
  "4h8h+": 1675,
  "4h9c+": 1676,
  "4h9h": 1677,
  "4h9h+": 1678,
  "4i1f": 1679,
  "4i1f+": 1680,
  "4i1i": 1681,
  "4i1i+": 1682,
  "4i2g": 1683,
  "4i2g+": 1684,
  "4i2i": 1685,
  "4i2i+": 1686,
  "4i3g": 1687,
  "4i3h": 1688,
  "4i3h+": 1689,
  "4i3i": 1690,
  "4i3i+": 1691,
  "4i4a+": 1692,
  "4i4b+": 1693,
  "4i4c": 1694,
  "4i4c+": 1695,
  "4i4d": 1696,
  "4i4d+": 1697,
  "4i4e": 1698,
  "4i4e+": 1699,
  "4i4f": 1700,
  "4i4f+": 1701,
  "4i4g": 1702,
  "4i4g+": 1703,
  "4i4h": 1704,
  "4i4h+": 1705,
  "4i5g": 1706,
  "4i5h": 1707,
  "4i5h+": 1708,
  "4i5i": 1709,
  "4i5i+": 1710,
  "4i6g": 1711,
  "4i6g+": 1712,
  "4i6i": 1713,
  "4i6i+": 1714,
  "4i7f": 1715,
  "4i7f+": 1716,
  "4i7i": 1717,
  "4i7i+": 1718,
  "4i8e": 1719,
  "4i8e+": 1720,
  "4i8i": 1721,
  "4i8i+": 1722,
  "4i9d": 1723,
  "4i9d+": 1724,
  "4i9i": 1725,
  "4i9i+": 1726,
  "5a1a": 1727,
  "5a1a+": 1728,
  "5a1e": 1729,
  "5a1e+": 1730,
  "5a2a": 1731,
  "5a2a+": 1732,
  "5a2d": 1733,
  "5a2d+": 1734,
  "5a3a": 1735,
  "5a3a+": 1736,
  "5a3c": 1737,
  "5a3c+": 1738,
  "5a4a": 1739,
  "5a4a+": 1740,
  "5a4b": 1741,
  "5a4b+": 1742,
  "5a4c": 1743,
  "5a5b": 1744,
  "5a5b+": 1745,
  "5a5c": 1746,
  "5a5c+": 1747,
  "5a5d": 1748,
  "5a5d+": 1749,
  "5a5e": 1750,
  "5a5e+": 1751,
  "5a5f": 1752,
  "5a5f+": 1753,
  "5a5g+": 1754,
  "5a5h": 1755,
  "5a5h+": 1756,
  "5a5i+": 1757,
  "5a6a": 1758,
  "5a6a+": 1759,
  "5a6b": 1760,
  "5a6b+": 1761,
  "5a6c": 1762,
  "5a7a": 1763,
  "5a7a+": 1764,
  "5a7c": 1765,
  "5a7c+": 1766,
  "5a8a": 1767,
  "5a8a+": 1768,
  "5a8d": 1769,
  "5a8d+": 1770,
  "5a9a": 1771,
  "5a9a+": 1772,
  "5a9e": 1773,
  "5a9e+": 1774,
  "5b1b": 1775,
  "5b1b+": 1776,
  "5b1f": 1777,
  "5b1f+": 1778,
  "5b2b": 1779,
  "5b2b+": 1780,
  "5b2e": 1781,
  "5b2e+": 1782,
  "5b3b": 1783,
  "5b3b+": 1784,
  "5b3d": 1785,
  "5b3d+": 1786,
  "5b4a": 1787,
  "5b4a+": 1788,
  "5b4b": 1789,
  "5b4b+": 1790,
  "5b4c": 1791,
  "5b4c+": 1792,
  "5b4d": 1793,
  "5b5a": 1794,
  "5b5a+": 1795,
  "5b5c": 1796,
  "5b5c+": 1797,
  "5b5d": 1798,
  "5b5d+": 1799,
  "5b5e": 1800,
  "5b5e+": 1801,
  "5b5f": 1802,
  "5b5f+": 1803,
  "5b5g": 1804,
  "5b5g+": 1805,
  "5b5h": 1806,
  "5b5h+": 1807,
  "5b5i": 1808,
  "5b5i+": 1809,
  "5b6a": 1810,
  "5b6a+": 1811,
  "5b6b": 1812,
  "5b6b+": 1813,
  "5b6c": 1814,
  "5b6c+": 1815,
  "5b6d": 1816,
  "5b7b": 1817,
  "5b7b+": 1818,
  "5b7d": 1819,
  "5b7d+": 1820,
  "5b8b": 1821,
  "5b8b+": 1822,
  "5b8e": 1823,
  "5b8e+": 1824,
  "5b9b": 1825,
  "5b9b+": 1826,
  "5b9f": 1827,
  "5b9f+": 1828,
  "5c1c": 1829,
  "5c1g": 1830,
  "5c1g+": 1831,
  "5c2c": 1832,
  "5c2c+": 1833,
  "5c2f": 1834,
  "5c2f+": 1835,
  "5c3a": 1836,
  "5c3a+": 1837,
  "5c3c": 1838,
  "5c3c+": 1839,
  "5c3e": 1840,
  "5c3e+": 1841,
  "5c4a+": 1842,
  "5c4b": 1843,
  "5c4b+": 1844,
  "5c4c": 1845,
  "5c4c+": 1846,
  "5c4d": 1847,
  "5c4d+": 1848,
  "5c4e": 1849,
  "5c5a": 1850,
  "5c5a+": 1851,
  "5c5b": 1852,
  "5c5b+": 1853,
  "5c5d": 1854,
  "5c5d+": 1855,
  "5c5e": 1856,
  "5c5e+": 1857,
  "5c5f": 1858,
  "5c5f+": 1859,
  "5c5g": 1860,
  "5c5g+": 1861,
  "5c5h": 1862,
  "5c5h+": 1863,
  "5c5i+": 1864,
  "5c6a+": 1865,
  "5c6b": 1866,
  "5c6b+": 1867,
  "5c6c": 1868,
  "5c6c+": 1869,
  "5c6d": 1870,
  "5c6d+": 1871,
  "5c6e": 1872,
  "5c7a": 1873,
  "5c7a+": 1874,
  "5c7c": 1875,
  "5c7c+": 1876,
  "5c7e": 1877,
  "5c7e+": 1878,
  "5c8c": 1879,
  "5c8c+": 1880,
  "5c8f": 1881,
  "5c8f+": 1882,
  "5c9c": 1883,
  "5c9g": 1884,
  "5c9g+": 1885,
  "5d1d": 1886,
  "5d1h": 1887,
  "5d1h+": 1888,
  "5d2a": 1889,
  "5d2a+": 1890,
  "5d2d": 1891,
  "5d2g": 1892,
  "5d2g+": 1893,
  "5d3b": 1894,
  "5d3b+": 1895,
  "5d3d": 1896,
  "5d3f": 1897,
  "5d4b+": 1898,
  "5d4c": 1899,
  "5d4c+": 1900,
  "5d4d": 1901,
  "5d4e": 1902,
  "5d4f": 1903,
  "5d5a": 1904,
  "5d5a+": 1905,
  "5d5b": 1906,
  "5d5b+": 1907,
  "5d5c": 1908,
  "5d5c+": 1909,
  "5d5e": 1910,
  "5d5f": 1911,
  "5d5g": 1912,
  "5d5g+": 1913,
  "5d5h": 1914,
  "5d5h+": 1915,
  "5d5i": 1916,
  "5d5i+": 1917,
  "5d6b+": 1918,
  "5d6c": 1919,
  "5d6c+": 1920,
  "5d6d": 1921,
  "5d6e": 1922,
  "5d6f": 1923,
  "5d7b": 1924,
  "5d7b+": 1925,
  "5d7d": 1926,
  "5d7f": 1927,
  "5d8a": 1928,
  "5d8a+": 1929,
  "5d8d": 1930,
  "5d8g": 1931,
  "5d8g+": 1932,
  "5d9d": 1933,
  "5d9h": 1934,
  "5d9h+": 1935,
  "5e1a": 1936,
  "5e1a+": 1937,
  "5e1e": 1938,
  "5e1i": 1939,
  "5e1i+": 1940,
  "5e2b": 1941,
  "5e2b+": 1942,
  "5e2e": 1943,
  "5e2h": 1944,
  "5e2h+": 1945,
  "5e3c": 1946,
  "5e3c+": 1947,
  "5e3e": 1948,
  "5e3g": 1949,
  "5e3g+": 1950,
  "5e4c": 1951,
  "5e4c+": 1952,
  "5e4d": 1953,
  "5e4e": 1954,
  "5e4f": 1955,
  "5e4g": 1956,
  "5e4g+": 1957,
  "5e5a": 1958,
  "5e5a+": 1959,
  "5e5b": 1960,
  "5e5b+": 1961,
  "5e5c": 1962,
  "5e5c+": 1963,
  "5e5d": 1964,
  "5e5f": 1965,
  "5e5g": 1966,
  "5e5g+": 1967,
  "5e5h": 1968,
  "5e5h+": 1969,
  "5e5i": 1970,
  "5e5i+": 1971,
  "5e6c": 1972,
  "5e6c+": 1973,
  "5e6d": 1974,
  "5e6e": 1975,
  "5e6f": 1976,
  "5e6g": 1977,
  "5e6g+": 1978,
  "5e7c": 1979,
  "5e7c+": 1980,
  "5e7e": 1981,
  "5e7g": 1982,
  "5e7g+": 1983,
  "5e8b": 1984,
  "5e8b+": 1985,
  "5e8e": 1986,
  "5e8h": 1987,
  "5e8h+": 1988,
  "5e9a": 1989,
  "5e9a+": 1990,
  "5e9e": 1991,
  "5e9i": 1992,
  "5e9i+": 1993,
  "5f1b": 1994,
  "5f1b+": 1995,
  "5f1f": 1996,
  "5f2c": 1997,
  "5f2c+": 1998,
  "5f2f": 1999,
  "5f2i": 2000,
  "5f2i+": 2001,
  "5f3d": 2002,
  "5f3f": 2003,
  "5f3h": 2004,
  "5f3h+": 2005,
  "5f4d": 2006,
  "5f4e": 2007,
  "5f4f": 2008,
  "5f4g": 2009,
  "5f4g+": 2010,
  "5f4h+": 2011,
  "5f5a": 2012,
  "5f5a+": 2013,
  "5f5b": 2014,
  "5f5b+": 2015,
  "5f5c": 2016,
  "5f5c+": 2017,
  "5f5d": 2018,
  "5f5e": 2019,
  "5f5g": 2020,
  "5f5g+": 2021,
  "5f5h": 2022,
  "5f5h+": 2023,
  "5f5i": 2024,
  "5f5i+": 2025,
  "5f6d": 2026,
  "5f6e": 2027,
  "5f6f": 2028,
  "5f6g": 2029,
  "5f6g+": 2030,
  "5f6h+": 2031,
  "5f7d": 2032,
  "5f7f": 2033,
  "5f7h": 2034,
  "5f7h+": 2035,
  "5f8c": 2036,
  "5f8c+": 2037,
  "5f8f": 2038,
  "5f8i": 2039,
  "5f8i+": 2040,
  "5f9b": 2041,
  "5f9b+": 2042,
  "5f9f": 2043,
  "5g1c": 2044,
  "5g1c+": 2045,
  "5g1g": 2046,
  "5g2d": 2047,
  "5g2d+": 2048,
  "5g2g": 2049,
  "5g2g+": 2050,
  "5g3e": 2051,
  "5g3e+": 2052,
  "5g3g": 2053,
  "5g3g+": 2054,
  "5g3i": 2055,
  "5g3i+": 2056,
  "5g4e": 2057,
  "5g4f": 2058,
  "5g4f+": 2059,
  "5g4g": 2060,
  "5g4g+": 2061,
  "5g4h": 2062,
  "5g4h+": 2063,
  "5g4i+": 2064,
  "5g5a+": 2065,
  "5g5b": 2066,
  "5g5b+": 2067,
  "5g5c": 2068,
  "5g5c+": 2069,
  "5g5d": 2070,
  "5g5d+": 2071,
  "5g5e": 2072,
  "5g5e+": 2073,
  "5g5f": 2074,
  "5g5f+": 2075,
  "5g5h": 2076,
  "5g5h+": 2077,
  "5g5i": 2078,
  "5g5i+": 2079,
  "5g6e": 2080,
  "5g6f": 2081,
  "5g6f+": 2082,
  "5g6g": 2083,
  "5g6g+": 2084,
  "5g6h": 2085,
  "5g6h+": 2086,
  "5g6i+": 2087,
  "5g7e": 2088,
  "5g7e+": 2089,
  "5g7g": 2090,
  "5g7g+": 2091,
  "5g7i": 2092,
  "5g7i+": 2093,
  "5g8d": 2094,
  "5g8d+": 2095,
  "5g8g": 2096,
  "5g8g+": 2097,
  "5g9c": 2098,
  "5g9c+": 2099,
  "5g9g": 2100,
  "5h1d": 2101,
  "5h1d+": 2102,
  "5h1h": 2103,
  "5h1h+": 2104,
  "5h2e": 2105,
  "5h2e+": 2106,
  "5h2h": 2107,
  "5h2h+": 2108,
  "5h3f": 2109,
  "5h3f+": 2110,
  "5h3h": 2111,
  "5h3h+": 2112,
  "5h4f": 2113,
  "5h4g": 2114,
  "5h4g+": 2115,
  "5h4h": 2116,
  "5h4h+": 2117,
  "5h4i": 2118,
  "5h4i+": 2119,
  "5h5a": 2120,
  "5h5a+": 2121,
  "5h5b": 2122,
  "5h5b+": 2123,
  "5h5c": 2124,
  "5h5c+": 2125,
  "5h5d": 2126,
  "5h5d+": 2127,
  "5h5e": 2128,
  "5h5e+": 2129,
  "5h5f": 2130,
  "5h5f+": 2131,
  "5h5g": 2132,
  "5h5g+": 2133,
  "5h5i": 2134,
  "5h5i+": 2135,
  "5h6f": 2136,
  "5h6g": 2137,
  "5h6g+": 2138,
  "5h6h": 2139,
  "5h6h+": 2140,
  "5h6i": 2141,
  "5h6i+": 2142,
  "5h7f": 2143,
  "5h7f+": 2144,
  "5h7h": 2145,
  "5h7h+": 2146,
  "5h8e": 2147,
  "5h8e+": 2148,
  "5h8h": 2149,
  "5h8h+": 2150,
  "5h9d": 2151,
  "5h9d+": 2152,
  "5h9h": 2153,
  "5h9h+": 2154,
  "5i1e": 2155,
  "5i1e+": 2156,
  "5i1i": 2157,
  "5i1i+": 2158,
  "5i2f": 2159,
  "5i2f+": 2160,
  "5i2i": 2161,
  "5i2i+": 2162,
  "5i3g": 2163,
  "5i3g+": 2164,
  "5i3i": 2165,
  "5i3i+": 2166,
  "5i4g": 2167,
  "5i4h": 2168,
  "5i4h+": 2169,
  "5i4i": 2170,
  "5i4i+": 2171,
  "5i5a+": 2172,
  "5i5b": 2173,
  "5i5b+": 2174,
  "5i5c+": 2175,
  "5i5d": 2176,
  "5i5d+": 2177,
  "5i5e": 2178,
  "5i5e+": 2179,
  "5i5f": 2180,
  "5i5f+": 2181,
  "5i5g": 2182,
  "5i5g+": 2183,
  "5i5h": 2184,
  "5i5h+": 2185,
  "5i6g": 2186,
  "5i6h": 2187,
  "5i6h+": 2188,
  "5i6i": 2189,
  "5i6i+": 2190,
  "5i7g": 2191,
  "5i7g+": 2192,
  "5i7i": 2193,
  "5i7i+": 2194,
  "5i8f": 2195,
  "5i8f+": 2196,
  "5i8i": 2197,
  "5i8i+": 2198,
  "5i9e": 2199,
  "5i9e+": 2200,
  "5i9i": 2201,
  "5i9i+": 2202,
  "6a1a": 2203,
  "6a1a+": 2204,
  "6a1f": 2205,
  "6a1f+": 2206,
  "6a2a": 2207,
  "6a2a+": 2208,
  "6a2e": 2209,
  "6a2e+": 2210,
  "6a3a": 2211,
  "6a3a+": 2212,
  "6a3d": 2213,
  "6a3d+": 2214,
  "6a4a": 2215,
  "6a4a+": 2216,
  "6a4c": 2217,
  "6a4c+": 2218,
  "6a5a": 2219,
  "6a5a+": 2220,
  "6a5b": 2221,
  "6a5b+": 2222,
  "6a5c": 2223,
  "6a6b": 2224,
  "6a6b+": 2225,
  "6a6c": 2226,
  "6a6c+": 2227,
  "6a6d": 2228,
  "6a6d+": 2229,
  "6a6e": 2230,
  "6a6e+": 2231,
  "6a6f": 2232,
  "6a6f+": 2233,
  "6a6g": 2234,
  "6a6g+": 2235,
  "6a6h+": 2236,
  "6a6i+": 2237,
  "6a7a": 2238,
  "6a7a+": 2239,
  "6a7b": 2240,
  "6a7b+": 2241,
  "6a7c": 2242,
  "6a8a": 2243,
  "6a8a+": 2244,
  "6a8c": 2245,
  "6a8c+": 2246,
  "6a9a": 2247,
  "6a9a+": 2248,
  "6a9d": 2249,
  "6a9d+": 2250,
  "6b1b": 2251,
  "6b1b+": 2252,
  "6b1g+": 2253,
  "6b2b": 2254,
  "6b2b+": 2255,
  "6b2f": 2256,
  "6b2f+": 2257,
  "6b3b": 2258,
  "6b3b+": 2259,
  "6b3e": 2260,
  "6b3e+": 2261,
  "6b4b": 2262,
  "6b4b+": 2263,
  "6b4d": 2264,
  "6b4d+": 2265,
  "6b5a": 2266,
  "6b5a+": 2267,
  "6b5b": 2268,
  "6b5b+": 2269,
  "6b5c": 2270,
  "6b5c+": 2271,
  "6b5d": 2272,
  "6b6a": 2273,
  "6b6a+": 2274,
  "6b6c": 2275,
  "6b6c+": 2276,
  "6b6d": 2277,
  "6b6d+": 2278,
  "6b6e": 2279,
  "6b6e+": 2280,
  "6b6f": 2281,
  "6b6f+": 2282,
  "6b6g": 2283,
  "6b6g+": 2284,
  "6b6h": 2285,
  "6b6h+": 2286,
  "6b6i": 2287,
  "6b6i+": 2288,
  "6b7a": 2289,
  "6b7a+": 2290,
  "6b7b": 2291,
  "6b7b+": 2292,
  "6b7c": 2293,
  "6b7c+": 2294,
  "6b7d": 2295,
  "6b8b": 2296,
  "6b8b+": 2297,
  "6b8d": 2298,
  "6b8d+": 2299,
  "6b9b": 2300,
  "6b9b+": 2301,
  "6b9e": 2302,
  "6b9e+": 2303,
  "6c1c": 2304,
  "6c1h": 2305,
  "6c1h+": 2306,
  "6c2c": 2307,
  "6c2c+": 2308,
  "6c2g+": 2309,
  "6c3c": 2310,
  "6c3c+": 2311,
  "6c3f": 2312,
  "6c3f+": 2313,
  "6c4a": 2314,
  "6c4a+": 2315,
  "6c4c": 2316,
  "6c4c+": 2317,
  "6c4e": 2318,
  "6c4e+": 2319,
  "6c5a+": 2320,
  "6c5b": 2321,
  "6c5b+": 2322,
  "6c5c": 2323,
  "6c5c+": 2324,
  "6c5d": 2325,
  "6c5d+": 2326,
  "6c5e": 2327,
  "6c6a": 2328,
  "6c6a+": 2329,
  "6c6b": 2330,
  "6c6b+": 2331,
  "6c6d": 2332,
  "6c6d+": 2333,
  "6c6e": 2334,
  "6c6e+": 2335,
  "6c6f": 2336,
  "6c6f+": 2337,
  "6c6g": 2338,
  "6c6g+": 2339,
  "6c6h+": 2340,
  "6c6i+": 2341,
  "6c7a+": 2342,
  "6c7b": 2343,
  "6c7b+": 2344,
  "6c7c": 2345,
  "6c7c+": 2346,
  "6c7d": 2347,
  "6c7d+": 2348,
  "6c7e": 2349,
  "6c8a": 2350,
  "6c8a+": 2351,
  "6c8c": 2352,
  "6c8c+": 2353,
  "6c8e": 2354,
  "6c8e+": 2355,
  "6c9c": 2356,
  "6c9c+": 2357,
  "6c9f": 2358,
  "6c9f+": 2359,
  "6d1d": 2360,
  "6d1i": 2361,
  "6d1i+": 2362,
  "6d2d": 2363,
  "6d2h": 2364,
  "6d2h+": 2365,
  "6d3a": 2366,
  "6d3a+": 2367,
  "6d3d": 2368,
  "6d3g": 2369,
  "6d3g+": 2370,
  "6d4b": 2371,
  "6d4b+": 2372,
  "6d4d": 2373,
  "6d4f": 2374,
  "6d5b+": 2375,
  "6d5c": 2376,
  "6d5c+": 2377,
  "6d5d": 2378,
  "6d5e": 2379,
  "6d5f": 2380,
  "6d6a": 2381,
  "6d6a+": 2382,
  "6d6b": 2383,
  "6d6b+": 2384,
  "6d6c": 2385,
  "6d6c+": 2386,
  "6d6e": 2387,
  "6d6f": 2388,
  "6d6g": 2389,
  "6d6g+": 2390,
  "6d6h": 2391,
  "6d6h+": 2392,
  "6d6i": 2393,
  "6d6i+": 2394,
  "6d7b+": 2395,
  "6d7c": 2396,
  "6d7c+": 2397,
  "6d7d": 2398,
  "6d7e": 2399,
  "6d7f": 2400,
  "6d8b": 2401,
  "6d8b+": 2402,
  "6d8d": 2403,
  "6d8f": 2404,
  "6d9a": 2405,
  "6d9a+": 2406,
  "6d9d": 2407,
  "6d9g": 2408,
  "6d9g+": 2409,
  "6e1e": 2410,
  "6e2a": 2411,
  "6e2a+": 2412,
  "6e2e": 2413,
  "6e2i": 2414,
  "6e2i+": 2415,
  "6e3b": 2416,
  "6e3b+": 2417,
  "6e3e": 2418,
  "6e3h": 2419,
  "6e3h+": 2420,
  "6e4c": 2421,
  "6e4c+": 2422,
  "6e4e": 2423,
  "6e4g": 2424,
  "6e4g+": 2425,
  "6e5c": 2426,
  "6e5c+": 2427,
  "6e5d": 2428,
  "6e5e": 2429,
  "6e5f": 2430,
  "6e5g": 2431,
  "6e5g+": 2432,
  "6e6a": 2433,
  "6e6a+": 2434,
  "6e6b": 2435,
  "6e6b+": 2436,
  "6e6c": 2437,
  "6e6c+": 2438,
  "6e6d": 2439,
  "6e6f": 2440,
  "6e6g": 2441,
  "6e6g+": 2442,
  "6e6h": 2443,
  "6e6h+": 2444,
  "6e6i": 2445,
  "6e6i+": 2446,
  "6e7c": 2447,
  "6e7c+": 2448,
  "6e7d": 2449,
  "6e7e": 2450,
  "6e7f": 2451,
  "6e7g": 2452,
  "6e7g+": 2453,
  "6e8c": 2454,
  "6e8c+": 2455,
  "6e8e": 2456,
  "6e8g": 2457,
  "6e8g+": 2458,
  "6e9b": 2459,
  "6e9b+": 2460,
  "6e9e": 2461,
  "6e9h": 2462,
  "6e9h+": 2463,
  "6f1a": 2464,
  "6f1a+": 2465,
  "6f1f": 2466,
  "6f2b": 2467,
  "6f2b+": 2468,
  "6f2f": 2469,
  "6f3c": 2470,
  "6f3c+": 2471,
  "6f3f": 2472,
  "6f3i": 2473,
  "6f3i+": 2474,
  "6f4d": 2475,
  "6f4f": 2476,
  "6f4h": 2477,
  "6f4h+": 2478,
  "6f5d": 2479,
  "6f5e": 2480,
  "6f5f": 2481,
  "6f5g": 2482,
  "6f5g+": 2483,
  "6f5h+": 2484,
  "6f6a": 2485,
  "6f6a+": 2486,
  "6f6b": 2487,
  "6f6b+": 2488,
  "6f6c": 2489,
  "6f6c+": 2490,
  "6f6d": 2491,
  "6f6e": 2492,
  "6f6g": 2493,
  "6f6g+": 2494,
  "6f6h": 2495,
  "6f6h+": 2496,
  "6f6i": 2497,
  "6f6i+": 2498,
  "6f7d": 2499,
  "6f7e": 2500,
  "6f7f": 2501,
  "6f7g": 2502,
  "6f7g+": 2503,
  "6f7h+": 2504,
  "6f8d": 2505,
  "6f8f": 2506,
  "6f8h": 2507,
  "6f8h+": 2508,
  "6f9c": 2509,
  "6f9c+": 2510,
  "6f9f": 2511,
  "6f9i": 2512,
  "6f9i+": 2513,
  "6g1b": 2514,
  "6g1b+": 2515,
  "6g1g": 2516,
  "6g2c": 2517,
  "6g2c+": 2518,
  "6g2g": 2519,
  "6g3d": 2520,
  "6g3d+": 2521,
  "6g3g": 2522,
  "6g3g+": 2523,
  "6g4e": 2524,
  "6g4e+": 2525,
  "6g4g": 2526,
  "6g4g+": 2527,
  "6g4i": 2528,
  "6g4i+": 2529,
  "6g5e": 2530,
  "6g5f": 2531,
  "6g5f+": 2532,
  "6g5g": 2533,
  "6g5g+": 2534,
  "6g5h": 2535,
  "6g5h+": 2536,
  "6g5i+": 2537,
  "6g6a+": 2538,
  "6g6b": 2539,
  "6g6b+": 2540,
  "6g6c": 2541,
  "6g6c+": 2542,
  "6g6d": 2543,
  "6g6d+": 2544,
  "6g6e": 2545,
  "6g6e+": 2546,
  "6g6f": 2547,
  "6g6f+": 2548,
  "6g6h": 2549,
  "6g6h+": 2550,
  "6g6i": 2551,
  "6g6i+": 2552,
  "6g7e": 2553,
  "6g7f": 2554,
  "6g7f+": 2555,
  "6g7g": 2556,
  "6g7g+": 2557,
  "6g7h": 2558,
  "6g7h+": 2559,
  "6g7i+": 2560,
  "6g8e": 2561,
  "6g8e+": 2562,
  "6g8g": 2563,
  "6g8g+": 2564,
  "6g8i": 2565,
  "6g8i+": 2566,
  "6g9d": 2567,
  "6g9d+": 2568,
  "6g9g": 2569,
  "6h1c": 2570,
  "6h1c+": 2571,
  "6h1h": 2572,
  "6h1h+": 2573,
  "6h2d": 2574,
  "6h2d+": 2575,
  "6h2h": 2576,
  "6h2h+": 2577,
  "6h3e": 2578,
  "6h3e+": 2579,
  "6h3h": 2580,
  "6h3h+": 2581,
  "6h4f": 2582,
  "6h4f+": 2583,
  "6h4h": 2584,
  "6h4h+": 2585,
  "6h5f": 2586,
  "6h5g": 2587,
  "6h5g+": 2588,
  "6h5h": 2589,
  "6h5h+": 2590,
  "6h5i": 2591,
  "6h5i+": 2592,
  "6h6a": 2593,
  "6h6a+": 2594,
  "6h6b+": 2595,
  "6h6c": 2596,
  "6h6c+": 2597,
  "6h6d": 2598,
  "6h6d+": 2599,
  "6h6e": 2600,
  "6h6e+": 2601,
  "6h6f": 2602,
  "6h6f+": 2603,
  "6h6g": 2604,
  "6h6g+": 2605,
  "6h6i": 2606,
  "6h6i+": 2607,
  "6h7f": 2608,
  "6h7g": 2609,
  "6h7g+": 2610,
  "6h7h": 2611,
  "6h7h+": 2612,
  "6h7i": 2613,
  "6h7i+": 2614,
  "6h8f": 2615,
  "6h8f+": 2616,
  "6h8h": 2617,
  "6h8h+": 2618,
  "6h9e": 2619,
  "6h9e+": 2620,
  "6h9h": 2621,
  "6h9h+": 2622,
  "6i1d": 2623,
  "6i1d+": 2624,
  "6i1i": 2625,
  "6i1i+": 2626,
  "6i2e": 2627,
  "6i2e+": 2628,
  "6i2i": 2629,
  "6i2i+": 2630,
  "6i3f": 2631,
  "6i3f+": 2632,
  "6i3i": 2633,
  "6i3i+": 2634,
  "6i4g": 2635,
  "6i4g+": 2636,
  "6i4i": 2637,
  "6i4i+": 2638,
  "6i5g": 2639,
  "6i5h": 2640,
  "6i5h+": 2641,
  "6i5i": 2642,
  "6i5i+": 2643,
  "6i6a+": 2644,
  "6i6b+": 2645,
  "6i6c": 2646,
  "6i6c+": 2647,
  "6i6d": 2648,
  "6i6d+": 2649,
  "6i6e": 2650,
  "6i6e+": 2651,
  "6i6f": 2652,
  "6i6f+": 2653,
  "6i6g": 2654,
  "6i6g+": 2655,
  "6i6h": 2656,
  "6i6h+": 2657,
  "6i7g": 2658,
  "6i7h": 2659,
  "6i7h+": 2660,
  "6i7i": 2661,
  "6i7i+": 2662,
  "6i8g": 2663,
  "6i8g+": 2664,
  "6i8i": 2665,
  "6i8i+": 2666,
  "6i9f": 2667,
  "6i9f+": 2668,
  "6i9i": 2669,
  "6i9i+": 2670,
  "7a1a": 2671,
  "7a1a+": 2672,
  "7a1g+": 2673,
  "7a2a": 2674,
  "7a2a+": 2675,
  "7a2f": 2676,
  "7a2f+": 2677,
  "7a3a": 2678,
  "7a3a+": 2679,
  "7a3e": 2680,
  "7a3e+": 2681,
  "7a4a": 2682,
  "7a4a+": 2683,
  "7a4d": 2684,
  "7a4d+": 2685,
  "7a5a": 2686,
  "7a5a+": 2687,
  "7a5c": 2688,
  "7a5c+": 2689,
  "7a6a": 2690,
  "7a6a+": 2691,
  "7a6b": 2692,
  "7a6b+": 2693,
  "7a6c": 2694,
  "7a7b": 2695,
  "7a7b+": 2696,
  "7a7c": 2697,
  "7a7c+": 2698,
  "7a7d": 2699,
  "7a7d+": 2700,
  "7a7e": 2701,
  "7a7e+": 2702,
  "7a7f": 2703,
  "7a7f+": 2704,
  "7a7g": 2705,
  "7a7g+": 2706,
  "7a7h": 2707,
  "7a7h+": 2708,
  "7a7i+": 2709,
  "7a8a": 2710,
  "7a8a+": 2711,
  "7a8b": 2712,
  "7a8b+": 2713,
  "7a8c": 2714,
  "7a9a": 2715,
  "7a9a+": 2716,
  "7a9c": 2717,
  "7a9c+": 2718,
  "7b1b": 2719,
  "7b1b+": 2720,
  "7b1h+": 2721,
  "7b2b": 2722,
  "7b2b+": 2723,
  "7b2g": 2724,
  "7b2g+": 2725,
  "7b3b": 2726,
  "7b3b+": 2727,
  "7b3f": 2728,
  "7b3f+": 2729,
  "7b4b": 2730,
  "7b4b+": 2731,
  "7b4e": 2732,
  "7b4e+": 2733,
  "7b5b": 2734,
  "7b5b+": 2735,
  "7b5d": 2736,
  "7b5d+": 2737,
  "7b6a": 2738,
  "7b6a+": 2739,
  "7b6b": 2740,
  "7b6b+": 2741,
  "7b6c": 2742,
  "7b6c+": 2743,
  "7b6d": 2744,
  "7b7a": 2745,
  "7b7a+": 2746,
  "7b7c": 2747,
  "7b7c+": 2748,
  "7b7d": 2749,
  "7b7d+": 2750,
  "7b7e": 2751,
  "7b7e+": 2752,
  "7b7f": 2753,
  "7b7f+": 2754,
  "7b7g": 2755,
  "7b7g+": 2756,
  "7b7h": 2757,
  "7b7h+": 2758,
  "7b7i+": 2759,
  "7b8a": 2760,
  "7b8a+": 2761,
  "7b8b": 2762,
  "7b8b+": 2763,
  "7b8c": 2764,
  "7b8c+": 2765,
  "7b8d": 2766,
  "7b9b": 2767,
  "7b9b+": 2768,
  "7b9d": 2769,
  "7b9d+": 2770,
  "7c1i": 2771,
  "7c1i+": 2772,
  "7c2c": 2773,
  "7c2c+": 2774,
  "7c2h+": 2775,
  "7c3c": 2776,
  "7c3c+": 2777,
  "7c3g": 2778,
  "7c3g+": 2779,
  "7c4c": 2780,
  "7c4c+": 2781,
  "7c4f": 2782,
  "7c4f+": 2783,
  "7c5a": 2784,
  "7c5a+": 2785,
  "7c5c": 2786,
  "7c5c+": 2787,
  "7c5e": 2788,
  "7c5e+": 2789,
  "7c6a+": 2790,
  "7c6b": 2791,
  "7c6b+": 2792,
  "7c6c": 2793,
  "7c6c+": 2794,
  "7c6d": 2795,
  "7c6d+": 2796,
  "7c6e": 2797,
  "7c7a": 2798,
  "7c7a+": 2799,
  "7c7b": 2800,
  "7c7b+": 2801,
  "7c7d": 2802,
  "7c7d+": 2803,
  "7c7e": 2804,
  "7c7e+": 2805,
  "7c7f": 2806,
  "7c7f+": 2807,
  "7c7g": 2808,
  "7c7g+": 2809,
  "7c7h+": 2810,
  "7c7i+": 2811,
  "7c8a+": 2812,
  "7c8b": 2813,
  "7c8b+": 2814,
  "7c8c": 2815,
  "7c8c+": 2816,
  "7c8d": 2817,
  "7c8d+": 2818,
  "7c8e": 2819,
  "7c9a": 2820,
  "7c9a+": 2821,
  "7c9c": 2822,
  "7c9c+": 2823,
  "7c9e": 2824,
  "7c9e+": 2825,
  "7d1d": 2826,
  "7d2d": 2827,
  "7d2i": 2828,
  "7d2i+": 2829,
  "7d3d": 2830,
  "7d3h": 2831,
  "7d3h+": 2832,
  "7d4a": 2833,
  "7d4a+": 2834,
  "7d4d": 2835,
  "7d4g": 2836,
  "7d4g+": 2837,
  "7d5b": 2838,
  "7d5b+": 2839,
  "7d5d": 2840,
  "7d5f": 2841,
  "7d6b+": 2842,
  "7d6c": 2843,
  "7d6c+": 2844,
  "7d6d": 2845,
  "7d6e": 2846,
  "7d6f": 2847,
  "7d7a": 2848,
  "7d7a+": 2849,
  "7d7b": 2850,
  "7d7b+": 2851,
  "7d7c": 2852,
  "7d7c+": 2853,
  "7d7e": 2854,
  "7d7f": 2855,
  "7d7g": 2856,
  "7d7g+": 2857,
  "7d7h": 2858,
  "7d7h+": 2859,
  "7d7i": 2860,
  "7d7i+": 2861,
  "7d8b+": 2862,
  "7d8c": 2863,
  "7d8c+": 2864,
  "7d8d": 2865,
  "7d8e": 2866,
  "7d8f": 2867,
  "7d9b": 2868,
  "7d9b+": 2869,
  "7d9d": 2870,
  "7d9f": 2871,
  "7e1e": 2872,
  "7e2e": 2873,
  "7e3a": 2874,
  "7e3a+": 2875,
  "7e3e": 2876,
  "7e3i": 2877,
  "7e3i+": 2878,
  "7e4b": 2879,
  "7e4b+": 2880,
  "7e4e": 2881,
  "7e4h": 2882,
  "7e4h+": 2883,
  "7e5c": 2884,
  "7e5c+": 2885,
  "7e5e": 2886,
  "7e5g": 2887,
  "7e5g+": 2888,
  "7e6c": 2889,
  "7e6c+": 2890,
  "7e6d": 2891,
  "7e6e": 2892,
  "7e6f": 2893,
  "7e6g": 2894,
  "7e6g+": 2895,
  "7e7a": 2896,
  "7e7a+": 2897,
  "7e7b": 2898,
  "7e7b+": 2899,
  "7e7c": 2900,
  "7e7c+": 2901,
  "7e7d": 2902,
  "7e7f": 2903,
  "7e7g": 2904,
  "7e7g+": 2905,
  "7e7h": 2906,
  "7e7h+": 2907,
  "7e7i": 2908,
  "7e7i+": 2909,
  "7e8c": 2910,
  "7e8c+": 2911,
  "7e8d": 2912,
  "7e8e": 2913,
  "7e8f": 2914,
  "7e8g": 2915,
  "7e8g+": 2916,
  "7e9c": 2917,
  "7e9c+": 2918,
  "7e9e": 2919,
  "7e9g": 2920,
  "7e9g+": 2921,
  "7f1f": 2922,
  "7f2a": 2923,
  "7f2a+": 2924,
  "7f2f": 2925,
  "7f3b": 2926,
  "7f3b+": 2927,
  "7f3f": 2928,
  "7f4c": 2929,
  "7f4c+": 2930,
  "7f4f": 2931,
  "7f4i": 2932,
  "7f4i+": 2933,
  "7f5d": 2934,
  "7f5f": 2935,
  "7f5h": 2936,
  "7f5h+": 2937,
  "7f6d": 2938,
  "7f6e": 2939,
  "7f6f": 2940,
  "7f6g": 2941,
  "7f6g+": 2942,
  "7f6h+": 2943,
  "7f7a": 2944,
  "7f7a+": 2945,
  "7f7b": 2946,
  "7f7b+": 2947,
  "7f7c": 2948,
  "7f7c+": 2949,
  "7f7d": 2950,
  "7f7e": 2951,
  "7f7g": 2952,
  "7f7g+": 2953,
  "7f7h": 2954,
  "7f7h+": 2955,
  "7f7i": 2956,
  "7f7i+": 2957,
  "7f8d": 2958,
  "7f8e": 2959,
  "7f8f": 2960,
  "7f8g": 2961,
  "7f8g+": 2962,
  "7f8h+": 2963,
  "7f9d": 2964,
  "7f9f": 2965,
  "7f9h": 2966,
  "7f9h+": 2967,
  "7g1a": 2968,
  "7g1a+": 2969,
  "7g1g": 2970,
  "7g2b": 2971,
  "7g2b+": 2972,
  "7g2g": 2973,
  "7g2g+": 2974,
  "7g3c": 2975,
  "7g3c+": 2976,
  "7g3g": 2977,
  "7g3g+": 2978,
  "7g4d": 2979,
  "7g4d+": 2980,
  "7g4g": 2981,
  "7g4g+": 2982,
  "7g5e": 2983,
  "7g5e+": 2984,
  "7g5g": 2985,
  "7g5g+": 2986,
  "7g5i": 2987,
  "7g5i+": 2988,
  "7g6e": 2989,
  "7g6f": 2990,
  "7g6f+": 2991,
  "7g6g": 2992,
  "7g6g+": 2993,
  "7g6h": 2994,
  "7g6h+": 2995,
  "7g6i+": 2996,
  "7g7a": 2997,
  "7g7a+": 2998,
  "7g7b+": 2999,
  "7g7c": 3000,
  "7g7c+": 3001,
  "7g7d": 3002,
  "7g7d+": 3003,
  "7g7e": 3004,
  "7g7e+": 3005,
  "7g7f": 3006,
  "7g7f+": 3007,
  "7g7h": 3008,
  "7g7h+": 3009,
  "7g7i": 3010,
  "7g7i+": 3011,
  "7g8e": 3012,
  "7g8f": 3013,
  "7g8f+": 3014,
  "7g8g": 3015,
  "7g8g+": 3016,
  "7g8h": 3017,
  "7g8h+": 3018,
  "7g8i+": 3019,
  "7g9e": 3020,
  "7g9e+": 3021,
  "7g9g": 3022,
  "7g9g+": 3023,
  "7g9i": 3024,
  "7g9i+": 3025,
  "7h1b+": 3026,
  "7h1h": 3027,
  "7h2c+": 3028,
  "7h2h": 3029,
  "7h2h+": 3030,
  "7h3d": 3031,
  "7h3d+": 3032,
  "7h3h": 3033,
  "7h3h+": 3034,
  "7h4e": 3035,
  "7h4e+": 3036,
  "7h4h": 3037,
  "7h4h+": 3038,
  "7h5f": 3039,
  "7h5f+": 3040,
  "7h5h": 3041,
  "7h5h+": 3042,
  "7h6f": 3043,
  "7h6g": 3044,
  "7h6g+": 3045,
  "7h6h": 3046,
  "7h6h+": 3047,
  "7h6i": 3048,
  "7h6i+": 3049,
  "7h7a+": 3050,
  "7h7b+": 3051,
  "7h7c": 3052,
  "7h7c+": 3053,
  "7h7d": 3054,
  "7h7d+": 3055,
  "7h7e": 3056,
  "7h7e+": 3057,
  "7h7f": 3058,
  "7h7f+": 3059,
  "7h7g": 3060,
  "7h7g+": 3061,
  "7h7i": 3062,
  "7h7i+": 3063,
  "7h8f": 3064,
  "7h8g": 3065,
  "7h8g+": 3066,
  "7h8h": 3067,
  "7h8h+": 3068,
  "7h8i": 3069,
  "7h8i+": 3070,
  "7h9f": 3071,
  "7h9f+": 3072,
  "7h9h": 3073,
  "7h9h+": 3074,
  "7i1c": 3075,
  "7i1c+": 3076,
  "7i1i": 3077,
  "7i1i+": 3078,
  "7i2d": 3079,
  "7i2d+": 3080,
  "7i2i": 3081,
  "7i2i+": 3082,
  "7i3e": 3083,
  "7i3e+": 3084,
  "7i3i": 3085,
  "7i3i+": 3086,
  "7i4f": 3087,
  "7i4f+": 3088,
  "7i4i": 3089,
  "7i4i+": 3090,
  "7i5g": 3091,
  "7i5g+": 3092,
  "7i5i": 3093,
  "7i5i+": 3094,
  "7i6g": 3095,
  "7i6h": 3096,
  "7i6h+": 3097,
  "7i6i": 3098,
  "7i6i+": 3099,
  "7i7a+": 3100,
  "7i7b+": 3101,
  "7i7c+": 3102,
  "7i7d": 3103,
  "7i7d+": 3104,
